package com.example.deepdev_03.muvito.Fragments;


import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import com.example.deepdev_03.muvito.R;


public class SubcategoriesFragment extends Fragment {


    public SubcategoriesFragment() {
        // Required empty public constructor
    }

    String womansClothing [] = {"Все объявления категории","Обувь", "Сумки и кошельки", "Верхняя одежда",
            "Платья и  юбки", "Свитеры и толстовки", "Джинсы и брюки", "Блузы и рубашки", "Пиджаки и костюмы",
            "Футболки и топы", "Белье и купальники", "Свадебные платья", "Будущим мамам",
            "Оджежда для спорта", "Аксессуары", "Часы", "Украшения", "Другое"};

    String mensClothing [] = {"Все объявления категории","Обувь", "Сумки и кошельки", "Верхняя одежда",
            "Футболки и поло", "Рубашки", "Джинсы и брюки", "Свитеры и толстовки", "Пиджаки и костюмы",
            "Одежда для спорта", "Нижнее белье и плавки","Спецодежда", "Аксессуары", "Часы","Другое"};

    String kidsGoods [] =  {"Все объявления категории","Коляски","Автокресла","Мебель для детей",
        "Куклы и игрушки", "Спортивные товары", "Кормление и питание", "Подгузники и пеленки",
        "Обувь", "Верхняя одежда", "Комбнезоны и боди","Платья и юбки", "Джинсы и брюки",
        "Трикотаж", "Аксессуары", "Другое"};

    String handmade [] = {"Все объявления категории", "Косметика", "Украшения", "Куклы и игрушки",
        "Оформление интерьера", "Аксессуары", "Оформление праздников", "Канцелярия", "Посуда",
        "Материалы", "Другое"};

    String autoMoto [] = {"Все объявления категории", "Автомобили", "Коммерческий транспорт",
        "Спецтехника","Мотоциклы и скутеры", "Мотоэкипировка","Шины и диски", "Аудио и видео",
        "Запчасти", "Багажники и фаркопы", "Автохимия", "Другое"};

    String smartphones [] = {"Все объявления категории", "Смартфоны", "Планшеты", "Умные часы",
        "Зарядные устройства", "Чехлы", "Аксессуары", "Запчасти", "Другое"};

    String photoVideo [] = {"Все объявления категории", "Видеокамеры","Фотоаппараты","Объективы",
            "Штативы и моноподы", "Фотовспышки", "Фотопринтеры", "Бинокли и телескопы",
            "Фоторамки", "Аксессуары", "Другое"};

    String computers [] = {"Все объявления категории", "Настольные и моноблоки", "Ноутбуки",
            "Мониторы", "Принтеры и сканеры", "Клавиатуры и мыши", "Комплектующие","Сетевое оборудование",
            "Аксессуары", "Расходные материалы", "Другое"};

    String electronics [] = {"Все объявления категории", "Телевизоры и проекторы", "Акустические системы",
            "Усилители и ресиверы", "Медиаплееры", "MP3-плееры","Наушники", "Электронные книги",
            "GPS-навигаторы", "Карты памяти", "Кабели и адаптеры","Другое"};

    String appliances [] = {"Все объявления категории", "Холодильники", "Плиты", "Микроволновые печи",
                "Посудомоечные машины", "Вытяжки", "Техника для кухни", "Стиральные машины", "Пылесосы",
                "Швейное оборудование", "Утюги", "Климатическая техника", "Другое"};

    String homeGoods [] = {"Все объявления категории", "Оформление интерьера", "Текстиль и ковры",
                "Освещение", "Посуда", "Диваны и кресла", "Кровати", "Шкафы и комоды", "Столы и стулья",
                "Подставки и тумбы", "Компьютерные столы","Кухонная мебель", "Растения", "Сад и огород",
                "Другое"};

    String building [] = {"Все объявления категории", "Электроинструменты", "Ручные инструменты",
                "Измерительные инструменты", "Стройматериалы", "Сантехника", "Электрика", "Окна",
                "Двери", "Отопление и вентиляция", "Другое"};

    String beauty [] = {"Все объявления категории", "Парфюмерия", "Макияж", "Маникюр и педикюр",
                "Уход за лицом", "Уход за волосами", "Уход за телом", "Фены и укладка", "Эпиляторы",
                "Стрижка и бритье", "Другое"};

    String sport [] = {"Все объявления категории", "Зимние виды спорта", "Тренажеры и фитнес",
                "Охота и рыбалка", "Туризм", "Водные виды спорта", "Велосипеды и самокаты",
                "Единоборства", "Ролики и скейтборды", "Игры с мячом", "Тенис, бадминтон, пинг-понг",
                "Другое"};

    String hobbies [] = {"Все объявления категории", "Консоли и игры", "Настольные игры",
                "Книги и журналы", "Коллекционирование", "Фильмы", "Музыка", "Другое"};

    String music [] = {"Все объявления категории", "Электрогитары", "Акустические гитары", "Бас-гитары",
                "Клавишные", "Смычковые инструменты", "Духовые инструменты","Ударные инструменты",
                "Народные инструменты", "Гитарное усиление", "Микшерные пульты", "Педали эффектов",
                "Другое"};

    String animals [] = {"Все объявления категории", "Собаки", "Кошки", "Птицы","Грызуны","Рыбки",
                "Товары для животных", "Другие животные"};

    String services [] = {"Все объявления категории", "Ремонт и строительство", "Мастер на час",
                "Перевозки", "Красота и здоровье", "Компьютерные услуги", "Автоуслуги", "Ремонт техники",
                "Обучение", "Организация праздников", "Фото- и видеосъемка", "Уборка", "Пошив одежды и обуви",
                "Продукты питания", "Другое"};

    String other [] = {"Все объявления категории", "Недвижимость","Для бизнеса", "Другое"};




    String[] subcategories [] = {womansClothing,mensClothing,kidsGoods,handmade,autoMoto,smartphones,
                photoVideo, computers, electronics, appliances, homeGoods, building, beauty, sport,
                hobbies, music, animals, services, other};



    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        View rootView = inflater.inflate(R.layout.fragment_subcategories, container, false);

        Bundle bundle = this.getArguments();

        if (bundle != null) {

            int position = bundle.getInt("SelectedPosition");

            ListView listView = (ListView) rootView.findViewById(R.id.listViewSubcategories);
            listView.setAdapter(new ArrayAdapter<String>(getActivity().getApplicationContext(),
                    R.layout.subcategories_item, R.id.textViewSubcategoriesItem, subcategories[position]));
        }

        return  rootView;
    }

}
